["Selama ini belajar pake kursus online berbayar ga paham paham konsep model ini, bersyukur nemu channel ini bisa dengan mudah langsung ngerti, terimakasih", "MasyaAllah, penjelasan bapak meski 3 tahun yang lalu sangat membantu saya dalam belajar machine learning untuk pemula. terimakasih banyak pak, semoga sehat dan berkah selalu. aamiin....", "bener2 mudah dipahami, saya pernah ikutan bootcamp Machine Learning dan kurg paham sama materinya. bersyukur bggt ketemu playlist ini. Terimakasih banyak pak\n\nmungkin boleh request ke tensorflow pak hehe", "Bermanfaat banget mas ! kebetulan saya lagi belajar Machine Learning tapi bingung mulai dari mana", "bisa belajar banyak disini, mudah dipahami, terus hadirkan materi machine learning yang baru, mas.", "terimakasih mas akhirnya say aham", "Mantap nih mudah diikuti", "Mantap baru kemaren, skrg udh rilis lg aja.", "Done", "pingin request kak, machine learning tp menggunakan library tensorflow, soalnya masih jarang tutorial tensorflow yg berbahasa Indonesia", "request tambahin plasylist studi kasus dong mas, biar gambaran ke depannya jelas. thanks", "berasa ikut kelas bootcamp", "heheh tiap hari harus rilis min", "ijin bertanya pak untuk parameter n_neighbors itu nilainya terserah kita atau harus diuji coba dulu ya pak?", "pak saya mau tanya, saya build sistem dengan low cost sensor.\nmenghasilkan data gas yang nilainya bergantung suhu dan waktu(siklus 24 jam). misal pagi datanya sekitar 10, siang 11, sore 1o dan malam sekitar 9. hampir ada polanya walaupun gak selalu sama persis. untuk mengoptimalkan low cost sensor tersebut saya pakai machine learning, jika ada alat yang standar untuk komparasi. maka metode ML apa yang cocok untuk saya dpt mengoptimalkan kinerja sensor tersebut. Terima Kasih. Salam", "Ijin bertanya Pak..Setelah production model..bagaimana langkah nya agar dapat digunakan misalnya ke website?Terima kasih", "Halo ka, mau tanya di bagian12:14kenapa punya ku error ya? aku pakai data yang video sklearn 02, data iris sebelumnya. terus di lanjut knn...", "baru tau ada joblib. berarti kalau mau memakai hasil joblib settingan K pada KNNnya terus 3 ya pak?", "Maaf mas mau tanya lagi,tadi kan habis nyelesaiin materi ini saya jadi penasaran sama contoh datasets selain iris nah setelah saya search di google sklearn punya datasets bawaan lain terus saya ambil yang wine dataset, terus habis itu sama kaya yang dataset iris mulai dari bikin variabel buat nyimpenwine.datasampe train_test_split semua normal² aja. Tapi pas saya feature_names itu tipenya beda kaya yang iris dimana tipenya itu malah merek alcohol nya . Jadi pertanyaan saya misal featurenya bukan dalam bentuk angka itu nanti yang di prediksikan apanya ya mas .\n\nSory kalo banyak tanya mas", "Maaf pak izin bertanya , saya pemula sedang berusaha mencerna vidio bapak , di dalam vidio kita membandingkan predict X test dengan Y test , tujuan di lakukan perbandingan itu untuk membuat model machine learning seperti apa yah pak , makasih sebelumnya", "mau tanya pak ,, di pemanfaatan trained model itu penentuan data baru bagaimana ?", "jadi train_set untuk proses melatih model dan test_set untuk proses evaluasi performa dari model yang ditraining, saya ada pertanyaan kang, \n\nuntuk kisaran akurasi yang baik itu minimal diangka berapa?\n\ndan misalkan model Kneigbourh yang di video memiliki akurasi 0.66 apakah harus diganti dengan model machine learning yang lain?\n\nuntuk mennggunakan suatu machine learning model nya yang sudah ditampung ke sebuah variabel nya bagaimana ya kak? seperti ini bukan kak \nproduction_model.predict([[5,3,3,2],[4,5,2,3]])", "Kak, untuk materi lanjutan setelah playlist ini selesai ada dimana ya?", "saya mendapatkan error ValueError: query data dimension must match training data dimension ketika mencoba membuat data_baru sesuai instruksi video9:56bagaimana ya cara menyelesaikannya, udah cari di stackoverflow masih belum paham", "Izin bertanya pak untuk training model, yang bagian model.fit(X_train, y_test), saya mendapat ValueError: Unknown label type: 'continuous-multioutput'. Itu bagaimana ya pak?", "9:28bang aku accuracy  nya kok 0.65 ya perasaan dah bener , ga error sih", "Maaf mau nanya, knp n_neighbors = 3? Terima kasih", "Selamat pagi, izin bertanya mas, saya mencoba melakukan predict untuk data iris ini tetapi loadnya bukan dari library melainkan download di kaggle. Dan modelnya Linear Regression.\n1. Bagaimana cara untuk melihat hasil predict agar targetnamesnya muncul ya? Saya coba teknik for loop seperti masnya dia error.\n2. Hasil predict saya berupa nilai float, bagaimana cara membacanya ya? apakah nilai 0-0.99 itu setosa, 1-1.99 itu versicolor, dan 2-2.99 itu virginica ya? Karena hasil di video dia berupa nilai Integer.\nTerima kasih banyak mas, maaf merepotkan karena masih cukup bingung karna stepnya beda hehe.", "izin bertanya, nilai acc aku 0,66666666666 , kira kira kenapa bisa seperti itu ya ?", "Apa saya yg salah baca ya, bukannya tgl 8 ya", "11:27Hasil prediksi : ['setosa', 'setosa', 'setosa', 'setosa'] , kok aku gtu", "Permisi pak mau nanya hehe, untuk pembelajaran ini rilisnya tiap hari apa?", "Siap mengawal channel ini sampai populer", "Bismillah usia sudah 33, ada basic Programming tapi sudah 13 tahun lalu.. Ga mau ketinggalan..\n\nTerimakasih mas budi udah buat channel ini.", "Semoga Mendapat Ilmu Yang Manfaat Dan Barokah Dunia Dan Akhirat", "Salam Indonesia belajar", "Auto turn on notifactions! Sangat terbantu dengan adanya channel ini!", "alhamdulillah bisa belajar online makasih bapak", "Keren bangett chanel nyaa", "Belajar trus", "Alhamdulillah terimakasih pak yg ditunggu tunggu,semog tetap semngat buat content kyk gini", "Salam belajar", "semangat terus pak", "Tks. Atas materinya", "Mohon izin Ikut belajar, manfaat sekali ilmunya", "Terima kasih", "Sangat sangat bermanfaat bagi generasi muda bangsa Indonesia. Semangat Pakk!", "terimakasih", "Hats off!", "Terimakasih byk atas ilmunya", "terimakasih materinya mudah dimengerti", "WAaahh yg gua tunggu tunggu", "mantap pak", "Mantap, ini yg ku tunggu", "sukses terus bang", "Haloo apa kakbar mas Budy , keren banget materinya  bagus banget dan penjesalannya sangat mudah dipahami., terimakasih.", "terima kasih kak", "baru tau nama lain output banyak banget, taunya paling dependent, label, dan respon", "Mantap pak lanjutkan!!", "Mantap", "LANJUTKAN PAK", "Pasukan notif", "Terima kasih pak Budi :D", "Keren ka ada e-book nya ga khusus phyton", "nice video pak :)", "halo bang. apa ada video lain yang membahas lebih tentang apa itu variable, label, features, dataframe dan penyebutan lainnya? saya baru dibidang ini dan saya takut salah untuk karya tulis, khususnya bagian menjelaskan kode program saya tidak boleh salah sebut", "kang lieur euy :(", "Kak, cara jadiin Jupyter Notebooknya sebagai presentation gimana ya kak ? terima kasih kak", "gw pemula jadi mau belajar", "permisi, apakah ada forum diskusi secara terpadu untuk belajar dan sharing sharing seputar ML ini?", "Yang mana yang harus dipelajari dahulu,  statistika atau probabilitas?", "Boleh request materi tentang MLflow gak?", "independence variabel termasuk istilah input juga kah mas?", "Pak cara install jupyter notebook gimana ya\n\nSaya install di ubuntu pake pip install jupyter-notebook yang keluar malah pip not found", "Notebook tentang Machine Learning bisa di dapat dimana  pak?\nAda link dowonload nya?", "Izin bertanya pak, apakah definisi dari machine learning itu dapat dikatakan merupakan teknik untuk mengimplementasikan Artificial Intelligence?", "maaf, \nlink ebooknya dmn??", "Halo pak, lihat script python dibagian mana ya? Soalnya skripsi saya ttg python tapi kurang memahami", "saya otodidak, tidak punya latar belakang pendidikan IT, apakah saya bakal berhasil belajar ml?", "Part 1 kak?", "Bang maaf video yang python sama struktur nya udah gaada ya? Saya cuma nemu pandas matplotlib aja", "Bikin discord pak", "halo pak, saya mau konsultasi mengenai data penelitian saya yang mana bertipe numerik dan kategorik dan saya mau mengklasikasikan data tersebut menggunakan algoritma xgboost, nah pa apa benar 2 tipe data ini tidak bisa digabung dalam analisis?", "Maaf pak, ada link untuk download bukunya nggk", "Min e book nya ada ?", "Ga ada file notebooknya ya mas di deskripsi?", "Modul nya bisa di unduh dimana ya ka?", "Link bukunya udah gak ada ya", "Mohon maaf pak, apakah bisa minta materinya?", "misi bang.apa data mining itu sama dngan machine Learning?", "maaf pak link bukunya mana ya?", "link bukunya mana yaaa", "discord link is no yet valid", "apakah aljabar linear tidak wajib dipelajari pak? untuk terjun ke machine learning?", "Gak perlu di bacain pak saya bisa baca sendiri", "pak, saya kurang ngerti konsep data train test, bagaimana kok tiba2 muncul hasil? itu data train dan test nya diapakan sama system?", "semoga terus mencedaskan INDONESIA BELAJAR", "Nice video. Emang harus belajar dari dasarnya dulu, kayak gini. Subscribing.", "saya merasa terbantukan dengan video - video yang Indonesia Mengajar ini telah upload. Penjelasannya sangat baik dan jelas untuk pemula seperti saya. keep going please!", "wah belajarnya saya untuk data scince sudah sampai sini", "Di kampus langsung dapatnya advance machine learning jadi kesulitan mengikuti dosen, terima kasih videonya memberikan banyak pencerahan", "mantap pak, sangat jelas", "terimakasih banyak mas atas ilmunya", "wah emang lebih enak belajar visual dan audio learning", "Mantap Pak", "oke done", "izin download pak.....", "sudah sampai sini hehe, waduh gaada 480p ya", "Mau tanya Pak, bagaimana implementasi pada python untuk memilih korelasi dataset dengan Correlation-based Feature\r Subset (CFS) Selection dengan method greedystepwise? pada aplikasi WEKA fitur tersebut akan tampil persentase setiap feature.", "Bismillah, mau bikin project bibit bandeng counter using computer vision. Kira2 pake model ML yang mana bang? mohon arahannya", "Lanjutkan bro, sabar banget jelaskannya :)", "Mase minta untuk plan silabus nya apa, mungkin ada yg bisa kita tambah. mantab tuntaskan sklearn mas baru ke Tensor dan keras", "terima kasih untuk ilmunya, saya ingin bertanya terkait pemberian colour kedalam data scatter, apakah warnanya sudah ditentukan oleh module dataset? atau kita bisa costum colour sendiri?", "Pak. Ada video tutorial clasifikasi data csv metode svm?", "Izin bertanya apakah bisa menggunakan G Collabs untuk menggantikan Jupyter notebook ?", "Besok ada cara mengintegrasikan machine learning ke app dll ga ya?", "saya terbiasa pakai pycharm professional utk develop , apa tidak apa apa tidak memakai jupyter notebook kak?", "pak lanjut donk kok  cuma sampai 16 plis bahas mengenai imbalance data pak", "Kak, berarti train_test_split tidak bisa diaplikasikan ketika data sudah terbagi dua seperti datasets yang ada di kaggle?", "Izin tanya Pak Budi... \n\napakah syntax DESCR itu untuk sklearn saja?Apa bedanya perintah DESCR dengan perintah describe()\ntadi saya coba pakai perintah describe tapi error\n\nterima kasih pak budi", "Pak izin bertanya, filtering X=X[:, :2] ini hanya sebagai contoh filtering atau karena alasan korelasi di DESCR", "dataset nya bisa didownload dimana ya?", "Pak tanya, gimana yah untuk load DEAP dataset? Dataset yang bukan dari scikit learn tentang EEG pak", "maaf mau nanya, jadi kan saya pakai google collab dan menemukan error begini : load_iris() got an unexpected keyword argument 'as_frame' . how can i solve it?", "mas mau nanya kalau misalnya testing dataset sama training dataset nya terpisah apa tetap perlu train_test_split ?", "pak load dataset bisa dari database? sedang cari contohnya", "ah, random state itu buat berapa banyak pengacakan terjadi, pantes pas dulu kuliah bingung gunanya untuk apa dan ngerasa apa yg dikerjain gada yang bener, alhasil make unsupervised k-means buat ta wkwkwkwk.", "mantap kang materinya mudah dipahami, cuma untuk mengetes nya bagaimana masukan perintah program apa ya?\nmisal saya ingin mengetahui bila sepal length= 5 dan sepal width= 4.3 akan masuk ke kategori apa? 'setosa', 'versicolor' atau 'virginica'", "saat print X Train dan X test, itu hasilnya ada 2 parameter, param yg ke dua itu apa ya?", "KeyError: 'key of type tuple not found and not a MultiIndex' permisi pak ini knp ya saat visualisasi data error spt ini, saya pakai dataframe sebagai panggilan kolom tabel dataset pada feature dan target", "Maaf mas, sedikit masukan untuk Pronunciation dalam bahasa Inggris mohon di benarkan,  kadang kala dlm pembelajaran ini sy hanya mendengar saja dan tidak melihat text. \n\nTerima kasih utk sharing ilmunya, mohon maaf apabila tdk berkenan", "Apabila nilai random_size diubah > 1 (& kelipatan bilangan bulat) apakah test_size akan selalu terpenuhi sebesar 0.3 ?", "permisi izin bertanya, kalau mau import data lain selain data iris bagaimana ya? terimakasih", "bagaimana script tersebut bisa langsung tau kolom yang digunakan sebagai variabel target (y) ?  padahal kita belum tentukan pada dataset tersebut mana yg akan jadi variabel targetnya.\n\nmohon petunjuk", "halo pak, untuk x[:, 0].min() kenapa harus dikurang 0.5 ya??", "mohon bertanya pak saya masih awam, sample datasets scikit learn itu gunanya untuka apa ya? cuma digunakan latihan kah?", "Kalo datasetnya dari lokal document ngeloadnya gimana?", "pak saya mau menjalankan codingan tp tidak bisa pak.", "Cara load dataest yg dr file csv gimana dong", "Mas saya masih agak bingung kenapa random_state = 1itu biar apa ya ?", "Penyampaiannya sih oke tapi materinya banyak kata kata statistik yang susah buat dimengerti apa emg gini belajar machine learning?", "argumen 'as_frame' belum dikenali di sklearn saya. jadi pakai pandas saja untuk membuat data frame", "Maaf ingin bertanya, pada saat proses scalling di menit11:41kok data sample_data -1.9 menjadi 0.58... dan untuk nilai minus lainnya menjadi 0 ? Bukannya -1.9 harusnya menjadi 0 ya ? terima kasih", "Sangat bermanfaat. Terimakasih pak", "Done.\nSemoga sehat terus ya Pak.", "Siapp", "Walau belum nonton, tapi mantap", "Request selanjutnya processing data dengan tipe kategori pak", "masih nungguin", "Book dulu bg,ada kerjaan hehe", "Pak izin bertanya, bedanya proses fitting dan transforming di scalarization itu apa ya, masih bingung hehe", "Pak mau bertanya untuk minmaxscaler itu dihitungnya per kolom kah?, kok nilai 1 dan 0 nya ada beragam?", "Saya ada beberapa pertanyaan mengenai video ini:\n1. Fungsi detail dari normalisasi L1 dan L2 seperti apa ?\n2. Dampak data setelah diberikan efek preprocessing ?\n3. Bagaiamana cara memilih proses data preprocessing tepat buat data kita ? Misal ada data A kenapa hanya memakai proses normalisasi saja dan data B kenapa hanya menggunakan preprocessing scaling saja. \n4. Apakah dalam suatu data kemungkinan ada data preprocessing sampai 2 kali misal normalisasi dan scaling atau memang kita hanya memilih salah satu saja ?\nTerima kasih atas perhatiannya pak.", "maaf izin bertanya, apa bila ingin mengimport dataset yang berupa csv atau excel itu bagaimana ya? agar dataset dapat terbaca pada saat pengklasifikasian?", "Pada saat apa kita menggunakan normalisasi dan minmax scalling pak?", "11:24kenapa method transform hasilnya sama dengan fit_transform? Apa bedanya dong line yangpreprocessor.fitdengan preprocessor.transform dengan preprocessor.fit_transform? Toh hasilnya sama", "Permisi Pak saya ingin bertanya, saya ingin mengolah data EEG hasil dari recording menggunakan sensor gelombang otak. Jadi saya punya 5 file data dengan format .CSV, saya ingin membuat machine learning mengenai penerjemahan sinyal gelombang otak sebagai penggerak kursi roda. Untuk tahap preprocessing datanya apakah Sama dengan preprocessing data pada scikit learn umumnya atau berbeda ya Pak?. Terimakasih banyak Pak", "pusing pak, terlalu ngebut, kurang lengkap penjelasannya, kenapa kita harus melakukan itu, manfaatnya apa, kenapa kita harus mengkonversi nilai numerik tsb dll, tbtb diajarkan \"how\"nya saja", "bang, ada source codenya ga yah ?", "multiple linear regression juga dong mas dibuat tutorial ya, biar tau perbedaan diantara keduanya mas", "tema sesulit ini jadi gampang di cerna dan dipahami berkat team indonesia belajar thanks yah!!!", "Ternyata benar, machine learning hubungannya erat dengan statistika.", "keren nih mudah diikuti. terima kasih banyak indonesia belajar.", "terimakasih mas, bermanfaat sekali ilmunya.", "Mohon bahas Support Vector Regression dengan kernel-kernelnya", "Mohon nanti setelah materi semua machine learning di ajarkan... Mohon ada projek tentang dunia kerja full ngebahas dunia kerja di data scientists", "33:07ValueError: Found input variables with inconsistent numbers of samples: [5, 4]\n\npadahal udh persis kyk di video", "izin belajar pak", "Mohon belajar jaringan syaraf tiruan khusus algoritma multilayer", "mantap bang.. kira2 ini sampe ke materi classification naive bayes, svm dll ga bang?", "bang ajari confusion matrix donk\nyang mana videonya plis lanjut pembelajaran machine learning", "Akhirnya nemu youtube data science yang enak dan jelas banget jelasinnya. Makasih yah kak udah buat youtube ini. Tapi aku mau tanya kak, Semisal aku buat model = LinearRegression(normalize=True) itu bisa kan yah kak? Soalnya aku pernah dijelasin pake normalize=true. Tapi sebenernya itu gimana sih kak konsepnya dan perbedaannya jika hanya model = LinearRegression()\nMohon bantuannya dan sukses selalu yah kak.", "Pak apakah cost function,gradient descent dan R squared itu sama?saya membaca buku prof Andrew tpi sangat tidak paham,apakah nanti  gradient descent di ajarkan pak?Dan juga saya bertemu dengan logistic dan linear regression?Beda keduanya apa ya pak?Terima Kasih", "Udah nonton smpe sini, dn alhamdulillah paham. Tapi pas mau coba itu saya bingung, implementasi pertama yg dilakukan yang mna ? Apakah tahapan dari vid ke 2 ini bisa ditiru dan ganti dataser dab metode apa yang kita ambil ? Ataubagaimana ?", "Nice education channel for programming..\n\nOh y, Mas mhn ijin bertanya, untuk nilai X_test [8,9,11,16,12], dan nilai y_test [11, 8.5, 15, 18, 11] itu darimana y? \n\ntrims", "Bagaimana cara untuk mengintegrasikan aplikasi yang dibuat berbasis web atau aplikasi yang dibuat berbasis android dengan machine learning (misalnya contoh sederhana prediksi harga pizza) di Scikit Learn ?  Terimakasih.", "Kak utk materi reshape apa sdh dibahas di playlist?? klo belum bs dijelaskan sedikit kak tentang teori nya. Terimakasih", "Izin tanya Pak Budi... \n\nKalau dalam aljabar, intercept selalu ada di sumbu x maupun sumbu y. Apakah ini juga berlaku dalam ML?", "kalau pembelajaran terkait backpropagation ada ga Pak?", "Mohon bantuannya, saya ada data pemasukan sampah bulanan, kira2 apa yg sy bisa lakukan untuk data ini menggunakan regresi linier sederhana?", "Pak kalau datanya dalam bentuk csv yg terdiri dari 2 kolom horsepower dan price, untuk X_train, y_train, X_test dan y_testnya gimana ya pak? semoga dijawab. Terima kasih", "pak, di menit30:54itu ada y_test dan x_test itu kita buatny gimana ya? asal isiin nominalnya ato gimana ya pak?", "Saya bikin model dari data frame, untuk x train dan y train kan berasal dari data yang ada di data frame-nya. lalu untuk data x test dan y test itu didapat dari mana agar kita dapat mengetahui r squared-nya berapa?", "bang klo hasil dari data frame yang dipanggil keluar NaN kenapa yaa", "reshape(-1, 1) bagian itu saya bingung pak,terutama saat menentukan angka(-1, 1) nya..", "14:00kenapa harus np.array([0, 25]).reshape(-1, 1) \n\nKenapa nggak langsung aja \nnp.array([0]\n               [25])", "Kira kira untuk lulusan s1, target atau materi yg minimal harus dikuasai untuk bisa melamar pekerjaan apa saja ya pak ?", "Oh ya kak nilai  testing set itu yaitu X_test dan y_test pada proses \"Training dan Testing Dataset\" itu darimana kak ya nilainya? Trmksh", "masih belom paham, y_test nya apakah random atau bagaimana", "pak, kenapa ko ditulis \"print(f'x: {x}')\"? ko nda langsung \"print(x)\"? 11.28", "Pak, mau nnya, kenapa variable x itu hrs dikonversi jadi dua dimensi sedangkan y tidsk hrus??", "pak mau nanya di29:45yang y_test dan x_test dapat darimana nilainya kok beda?", "Mau bertanya kenapa punya saya error mulu di buat model fit nya?", "Apkh bisa di share source code nya? Trimakasih", "ada link source code nya kah pak?"]